<div class="ceo">
    <div class="ceo__image">
        <img src="images/ceo.png" alt="ผู้บังคับบัญชา">
    </div>
    <div class="ceo__body">
        <h3 class="ceo__body__name">
            พล.ท.ชาติชาย ขันสุวรรณ
            <span class="ceo__body__position">ผู้อำนวยการสำนักงานส่งเสริมการท่องเที่ยวกองทัพบก</span>
        </h3>
        <p class="ceo__body__description">
            &ldquo;ยินดีต้อนรับทุกท่านเข้าสู่เว็บไซต์&rdquo; ท่องเที่ยวกองทัพบกข้อมูลในเว็บไซต์นี้ ท่านจะได้เข้าไปสัมผัสกับสถานที่ท่องเที่ยวในเขตทหาร ทั่วประเทศไทย ที่มีความน่าสนใจและมีความหลากหลาย ทั้งแหล่งท่องเที่ยวทางธรรมชาติ แหล่งท่องเที่ยวทางศิลปวัฒนธรรม แหล่งท่องเที่ยวทางโบราณสถานและประวัติศาสตร์ และแหล่งท่องเที่ยวเพื่อการนันทนาการและการผจญภัย
        </p>   
    </div>
</div>