<?php 

return [
    
    'heading' => [
        'places' => 'สถานที่ท่องเที่ยว',
        'populars' => 'สถานที่ท่องเที่ยวยอดนิยม',
        'recommended' => 'สถานที่ท่องเที่ยวแนะนำ',
        'about' => 'เกี่ยวกับเรา',
        'photo' => 'คลังภาพ',
        'video' => 'วีดีโอ',
        'panorama' => 'พาโนรามา',
        'marker' => 'ภาพ AR',
        'nearby' => 'สถานที่ท่องเที่ยวใกล้เคียง',
        'favorites' => 'สถานที่โปรด'
    ],

    'buttons' => [
        'readmore' => 'อ่านทั้งหมด',
        'viewall' => 'ดูทั้งหมด',
    ],

    'notfound' => 'ไม่พบข้อมูล'

];