<?php 

return [
    
    'heading' => [
        'places' => 'รายชื่อแหล่งท่องเที่ยว',
        'populars' => 'แหล่งท่องเที่ยวในเขตทหารยอดนิยม',
        'ar_code' => 'AR Code คืออะไร',
        'recommended' => 'แหล่งท่องเที่ยวในเขตทหารกับ AR Code',
        'about' => 'เกี่ยวกับเรา',
        'photo' => 'คลังภาพ',
        'video' => 'วีดีโอ',
        'panorama' => 'พาโนรามา',
        'marker' => 'ภาพ AR',
        'nearby' => 'สถานที่ท่องเที่ยวใกล้เคียง',
        'favorites' => 'สถานที่โปรด',
        'filter' => 'ตัวกรอง',
    ],

    'buttons' => [
        'to_map' => 'ไปยังแผนที่',
        'to_content' => 'ไปยังเนื้อหา',
        'favorite' => 'รายการโปรด',
        'share' => 'แชร์',
        'readmore' => [
            'อ่านทั้งหมด',
            'ซ่อน'
        ],
        'viewall' => [
            'ดูทั้งหมด',
            'ซ่อน'
        ]
    ],

    'notfound' => 'ไม่พบข้อมูล',

    'views' => 'จำนวนผู้เข้าชม :views ครั้ง'

];