<?php 

return [

    'heading' => [
        'login' => 'เข้าสู่ระบบ',
        'register' => 'ลงทะเบียน',
        'reset' => 'ลืมรหัสผ่าน',
    ],

    'descriptions' => [
        'login' => 'เข้าสู่ระบบเพื่อบันทึกแหล่งท่องเที่ยวที่ท่านเชื่อชอบได้',
        'reset' => 'กรุณากรอกอีเมลล์ของท่านที่ได้สมัครไว่กับทางเวปไซด์ ทางเราจะส่งวิธีการเปลื่ยนรหัสให้ทางอีเมล์'
    ],

    'inputs' => [
        'name' => 'ชื่อสกุล',
        'email' => 'อีเมลล์',
        'password' => 'รหัสผ่าน',
        'password_confirmation' => 'ยืนยันรหัสผ่าน',
    ],

    'search' => 'ค้นหา',

    'recommended' => 'แนะนำ',

    'buttons' => [
        'login' => 'เข้าสู่ระบบ',
        'register' => 'ลงทะเบียน',
        'facebook' => 'เข้าสู่ระบบโดย facebook',
        'google' => 'เข้าสู่ระบบโดย google+',
        'confirm' => 'ยืนยัน',
        'send' => 'ส่ง',
    ]
    
];